[
  {
    "id": 1,
    "company": "Swisscom Schweiz AG",
    "position": "Full-Stack Engineer @ DNA Data Services",
    "timestamp": "01/03/2024 - 31/07/2024",
    "description": "As a Fullstack Engineer I support the Atlas team in the further development of internal data web applications.",
    "technologies": [
      "Vue 3",
      "JS",
      "Docker",
      "Kubernetes",
      "Kafka",
      "AWS S3",
      "Cypress"
    ],
    "projects": [
      {
        "title": "Swisscom Data Console",
        "description": "Swisscom Data Console is an interal tool to work with big data, we maintained and developed the GUI for it, so there is a user friendly interaction available. There I have worked to implement different features, fix bugs and make the platform an better website."
      },
      {
        "title": "Compass",
        "description": "Is an fork of the offical open-source web-app that was adjusted to use it for interacting with big data."
      }
    ]
  },
  {
    "id": 2,
    "company": "Swisscom Schweiz AG",
    "position": "Apps Team Full-stack Developer",
    "timestamp": "01/03/2023 - 01/03/2024",
    "description": "Through my work in the Apps team, I have acquired in-depth knowledge of JavaScript, TypeScript, NestJs, MariaDB and React. I was able to actively participate in a large number of customer projects and realize some of them completely independently. This enabled me to acquire skills from planning to development.",
    "technologies": [
      "NestJS",
      "PrismaORM",
      "MariaDB",
      "TS",
      "AWS S3",
      "React",
      "Tailwind CSS"
    ],
    "projects": [
      {
        "title": "Swisscom Event Planning Tool",
        "description": "This project involved creating a website to display various upcoming events. The goal was to place these displays at the entrance of the offices, allowing employees to view upcoming events. I worked entirely independently on this customer project. To achieve this, I planned a comprehensive database schema, which formed the foundation for developing the backend of the website. The backend was built using NestJS and PrismaORM, with API documentation created using Swagger. Once the backend was complete, I developed the frontend based on mockups provided by the designers. The frontend was built using React, Tailwind CSS, and TypeScript."
      },
      {
        "title": "Compass",
        "description": "Is an fork of the offical open-source web-app that was adjusted to use it for interacting with big data."
      }
    ]
  },
  {
    "id": 3,
    "company": "Swisscom Schweiz AG",
    "position": "Mac Workplace Team",
    "timestamp": "01/08/2022 - 01/02/2023",
    "description": "Support of the Managed Mac Service from A to Z, development of bash scripts, deployment of new operating system and application releases (macOS), work in 3rd level support (OneITSM). Mainly involved with bash scripts, such as development, administration and deployment.",
    "technologies": ["Jamf", "MDM", "Bash", "macOS"],
    "projects": [
      {
        "title": "Set Outlook as default mail client",
        "description": "Automated the process to set the default mail client to outlook without the need of the login for apple's mail client"
      },
      {
        "title": "Remove Apple ID before erasing Mac",
        "description": "Automated the loggout process in case of erasing the Mac."
      },
      {
        "title": "Reactivate FileVault on Mac",
        "description": "Automated the process in case of reactivation of the FileVault"
      },
      {
        "title": "Cisco AnyConnect Secure Mobility Client",
        "description": "Automated the process for updating and upgrading the app without prompting the user"
      }
    ]
  }
]
